# ComboBoxDropDownClosedEventArgs Properties

---
The ComboBoxDropDownClosedEventArgs type exposes the following members.
| Name| Description
---|---|---
| Application|  The current UIApplication. (Inherited from RibbonItemEventArgs)
Top
#### Reference
ComboBoxDropDownClosedEventArgs Class
Autodesk.Revit.UI.Events Namespace